tap "luoandorder/tap"
tap "steipete/tap"
brew "bat"
brew "chezmoi"
brew "eza"
brew "fd"
brew "fzf"
brew "gh"
brew "git"
brew "jq"
brew "librsvg"
brew "mise"
brew "neovim"
brew "pandoc"
brew "ripgrep"
brew "scmpuff"
brew "starship"
brew "typst"
brew "uv"
brew "zoxide"
brew "luoandorder/tap/todoist-cli"
brew "steipete/tap/gogcli"
brew "steipete/tap/spogo"
brew "steipete/tap/summarize"
cask "basictex"
cask "cursor"
cask "font-symbols-only-nerd-font"
cask "ghostty"
cask "linearmouse"
cask "visual-studio-code"
vscode "aaron-bond.better-comments"
vscode "asvetliakov.vscode-neovim"
vscode "christian-kohler.path-intellisense"
vscode "dooez.alt-catppuccin-vsc"
vscode "eamodio.gitlens"
vscode "github.copilot-chat"
vscode "gruntfuggly.todo-tree"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "pkief.material-icon-theme"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "streetsidesoftware.code-spell-checker"
vscode "yzhang.markdown-all-in-one"
uv "pre-commit"
uv "ruff"
