tap "luoandorder/tap"
tap "steipete/tap"
brew "bat"
brew "chezmoi"
brew "eza"
brew "fd"
brew "fzf"
brew "gh"
brew "git"
brew "jq"
brew "librsvg"
brew "mise"
brew "pandoc"
brew "ripgrep"
brew "starship"
brew "typst"
brew "uv"
brew "zoxide"
brew "luoandorder/tap/todoist-cli"
brew "steipete/tap/gogcli"
brew "steipete/tap/spogo"
brew "steipete/tap/summarize"
cask "basictex"
cask "cursor"
cask "ghostty"
cask "visual-studio-code"
vscode "dooez.alt-catppuccin-vsc"
vscode "github.copilot-chat"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
go "github.com/Hyaxia/blogwatcher/cmd/blogwatcher"
go "cmd/go"
go "cmd/gofmt"
uv "pre-commit"
uv "ruff"
